ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/prot/cy_prot.h
#if !defined(__CY_PROT_H__)
#define __CY_PROT_H__

#include <stdbool.h>
#include "syslib/cy_syslib.h"
#include "cy_device_headers.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_prot_macro
* \{
*/

/** Driver major version */
#define CY_PROT_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_PROT_DRV_VERSION_MINOR       0

/** Prot driver ID */
#define CY_PROT_ID CY_PDL_DRV_ID(0x30u)

/** \} group_prot_macro */

/**
* \addtogroup group_prot_enums
* \{
*/

/**
* Prot Driver error codes
*/
typedef enum
{
    CY_PROT_SUCCESS   = 0x00u,                                    /**< Returned successful */
    CY_PROT_BAD_PARAM = CY_PROT_ID | CY_PDL_STATUS_ERROR | 0x01u, /**< Bad parameter was passed */
    CY_PROT_FAILURE   = CY_PROT_ID | CY_PDL_STATUS_ERROR | 0x03u  /**< The resource is locked */
} cy_en_prot_status_t;

/**
* User/Privileged permission
*/
typedef enum
{
    CY_PROT_PERM_DISABLED = 0x00u, /**< Read, Write and Execute disabled */
    CY_PROT_PERM_R        = 0x01u, /**< Read enabled */
    CY_PROT_PERM_W        = 0x02u, /**< Write enabled */
    CY_PROT_PERM_RW       = 0x03u, /**< Read and Write enabled */
    CY_PROT_PERM_X        = 0x04u, /**< Execute enabled */
    CY_PROT_PERM_RX       = 0x05u, /**< Read and Execute enabled */
    CY_PROT_PERM_WX       = 0x06u, /**< Write and Execute enabled */
    CY_PROT_PERM_RWX      = 0x07u  /**< Read, Write and Execute enabled */
}cy_en_prot_perm_t;

/**
* Memory region size
*/
typedef enum
{
    CY_PROT_SIZE_256B  = 7u,  /**< 256 bytes */
    CY_PROT_SIZE_512B  = 8u,  /**< 512 bytes */
    CY_PROT_SIZE_1KB   = 9u,  /**< 1 Kilobyte */
    CY_PROT_SIZE_2KB   = 10u, /**< 2 Kilobytes */
    CY_PROT_SIZE_4KB   = 11u, /**< 4 Kilobytes */
    CY_PROT_SIZE_8KB   = 12u, /**< 8 Kilobytes */
    CY_PROT_SIZE_16KB  = 13u, /**< 16 Kilobytes */
    CY_PROT_SIZE_32KB  = 14u, /**< 32 Kilobytes */
    CY_PROT_SIZE_64KB  = 15u, /**< 64 Kilobytes */
    CY_PROT_SIZE_128KB = 16u, /**< 128 Kilobytes */
    CY_PROT_SIZE_256KB = 17u, /**< 256 Kilobytes */
    CY_PROT_SIZE_512KB = 18u, /**< 512 Kilobytes */
    CY_PROT_SIZE_1MB   = 19u, /**< 1 Megabyte */
    CY_PROT_SIZE_2MB   = 20u, /**< 2 Megabytes */
    CY_PROT_SIZE_4MB   = 21u, /**< 4 Megabytes */
    CY_PROT_SIZE_8MB   = 22u, /**< 8 Megabytes */
    CY_PROT_SIZE_16MB  = 23u, /**< 16 Megabytes */
    CY_PROT_SIZE_32MB  = 24u, /**< 32 Megabytes */
    CY_PROT_SIZE_64MB  = 25u, /**< 64 Megabytes */
    CY_PROT_SIZE_128MB = 26u, /**< 128 Megabytes */
    CY_PROT_SIZE_256MB = 27u, /**< 256 Megabytes */
    CY_PROT_SIZE_512MB = 28u, /**< 512 Megabytes */
    CY_PROT_SIZE_1GB   = 29u, /**< 1 Gigabyte */
    CY_PROT_SIZE_2GB   = 30u, /**< 2 Gigabytes */
    CY_PROT_SIZE_4GB   = 31u  /**< 4 Gigabytes */
}cy_en_prot_size_t;

/**
* Protection Context (PC)
*/
enum cy_en_prot_pc_t
{
    CY_PROT_PC1  = 1u,  /**< PC = 1 */
    CY_PROT_PC2  = 2u,  /**< PC = 2 */
    CY_PROT_PC3  = 3u,  /**< PC = 3 */
    CY_PROT_PC4  = 4u,  /**< PC = 4 */
    CY_PROT_PC5  = 5u,  /**< PC = 5 */
    CY_PROT_PC6  = 6u,  /**< PC = 6 */
    CY_PROT_PC7  = 7u,  /**< PC = 7 */
    CY_PROT_PC8  = 8u,  /**< PC = 8 */
    CY_PROT_PC9  = 9u,  /**< PC = 9 */
    CY_PROT_PC10 = 10u, /**< PC = 10 */
    CY_PROT_PC11 = 11u, /**< PC = 11 */
    CY_PROT_PC12 = 12u, /**< PC = 12 */
    CY_PROT_PC13 = 13u, /**< PC = 13 */
    CY_PROT_PC14 = 14u, /**< PC = 14 */
    CY_PROT_PC15 = 15u  /**< PC = 15 */
};

/**
* Subregion disable (0-7)
*/
enum cy_en_prot_subreg_t
{
    CY_PROT_SUBREGION_DIS0 = 0x01u,  /**< Disable subregion 0 */
    CY_PROT_SUBREGION_DIS1 = 0x02u,  /**< Disable subregion 1 */
    CY_PROT_SUBREGION_DIS2 = 0x04u,  /**< Disable subregion 2 */
    CY_PROT_SUBREGION_DIS3 = 0x08u,  /**< Disable subregion 3 */
    CY_PROT_SUBREGION_DIS4 = 0x10u,  /**< Disable subregion 4 */
    CY_PROT_SUBREGION_DIS5 = 0x20u,  /**< Disable subregion 5 */
    CY_PROT_SUBREGION_DIS6 = 0x40u,  /**< Disable subregion 6 */
    CY_PROT_SUBREGION_DIS7 = 0x80u   /**< Disable subregion 7 */
};

/**
* Protection context mask (PC_MASK)
*/
enum cy_en_prot_pcmask_t
{
    CY_PROT_PCMASK1  = 0x0001u,  /**< Mask to allow PC = 1 */
    CY_PROT_PCMASK2  = 0x0002u,  /**< Mask to allow PC = 2 */
    CY_PROT_PCMASK3  = 0x0004u,  /**< Mask to allow PC = 3 */
    CY_PROT_PCMASK4  = 0x0008u,  /**< Mask to allow PC = 4 */
    CY_PROT_PCMASK5  = 0x0010u,  /**< Mask to allow PC = 5 */
    CY_PROT_PCMASK6  = 0x0020u,  /**< Mask to allow PC = 6 */
    CY_PROT_PCMASK7  = 0x0040u,  /**< Mask to allow PC = 7 */
    CY_PROT_PCMASK8  = 0x0080u,  /**< Mask to allow PC = 8 */
    CY_PROT_PCMASK9  = 0x0100u,  /**< Mask to allow PC = 9 */
    CY_PROT_PCMASK10 = 0x0200u,  /**< Mask to allow PC = 10 */
    CY_PROT_PCMASK11 = 0x0400u,  /**< Mask to allow PC = 11 */
    CY_PROT_PCMASK12 = 0x0800u,  /**< Mask to allow PC = 12 */
    CY_PROT_PCMASK13 = 0x1000u,  /**< Mask to allow PC = 13 */
    CY_PROT_PCMASK14 = 0x2000u,  /**< Mask to allow PC = 14 */
    CY_PROT_PCMASK15 = 0x4000u   /**< Mask to allow PC = 15 */
};

/** \} group_prot_enums */


/***************************************
*        Constants
***************************************/

/** \cond INTERNAL */

/* General Masks and shifts */
#define    CY_PROT_MSX_CTL_SHIFT                 (0x02UL) /**< Shift for MSx_CTL register */
#define    CY_PROT_STRUCT_ENABLE                 (0x01UL) /**< Enable protection unit struct */
#define CY_PROT_ADDR_SHIFT                    (8UL)    /**< Address shift for MPU, SMPU and PROG PPU structs */

/* Permission masks and shifts */
#define    CY_PROT_ATT_PERMISSION_MASK           (0x07UL) /**< Protection Unit attribute permission mask */
#define    CY_PROT_ATT_USER_PERMISSION_SHIFT     (0x00UL) /**< Protection Unit user attribute permission shift */
#define    CY_PROT_ATT_PRIV_PERMISSION_SHIFT     (0x03UL) /**< Protection Unit priliged attribute permission shift */

/* Protection Context limit masks */
#define CY_PROT_MPU_PC_LIMIT_MASK             (0xFFFFFFFFUL << CPUSS_PROT_SMPU_MS0_PC_NR_MINUS1)
#define CY_PROT_SMPU_PC_LIMIT_MASK            (0xFFFFFFFFUL << CPUSS_SMPU_STRUCT_PC_NR_MINUS1)
#define CY_PROT_PPU_PROG_PC_LIMIT_MASK        (0xFFFFFFFFUL << PERI_PPU_PROG_STRUCT_PC_NR_MINUS1)
#define CY_PROT_PPU_FIXED_PC_LIMIT_MASK       (0xFFFFFFFFUL << PERI_PPU_FIXED_STRUCT_PC_NR_MINUS1)

/* Parameter validation masks to check for read-only values */
#define CY_PROT_SMPU_ATT0_MASK                ((uint32_t)~(PROT_SMPU_SMPU_STRUCT_ATT0_PC_MASK_0_Msk))
#define CY_PROT_SMPU_ATT1_MASK                ((uint32_t)~(PROT_SMPU_SMPU_STRUCT_ATT1_UR_Msk \
                                                       | PROT_SMPU_SMPU_STRUCT_ATT1_UX_Msk \
                                                       | PROT_SMPU_SMPU_STRUCT_ATT1_PR_Msk \
                                                       | PROT_SMPU_SMPU_STRUCT_ATT1_PX_Msk \
                                                       | PROT_SMPU_SMPU_STRUCT_ATT1_PC_MASK_0_Msk \
                                                       | PROT_SMPU_SMPU_STRUCT_ATT1_REGION_SIZE_Msk \
                                              ))
#define CY_PROT_PPU_PROG_ATT0_MASK            ((uint32_t)~(PERI_PPU_GR_ATT1_UX_Msk \
                                                       | PERI_PPU_GR_ATT1_PX_Msk \
                                                       |PERI_PPU_PR_ATT0_PC_MASK_0_Msk \
                                              ))
#define CY_PROT_PPU_PROG_ATT1_MASK            ((uint32_t)~(PERI_PPU_PR_ATT1_UR_Msk \
                                                       | PERI_PPU_PR_ATT1_UX_Msk \
                                                       | PERI_PPU_PR_ATT1_PR_Msk \
                                                       | PERI_PPU_PR_ATT1_PX_Msk \
                                                       | PERI_PPU_PR_ATT1_PC_MASK_0_Msk \
                                                       | PERI_PPU_PR_ATT1_REGION_SIZE_Msk \
                                              ))
#define CY_PROT_PPU_GR_ATT0_MASK              ((uint32_t)~(PERI_PPU_GR_ATT0_UX_Msk \
                                                       | PERI_PPU_GR_ATT0_PX_Msk \
                                                       | PERI_PPU_GR_ATT0_PC_MASK_0_Msk \
                                                       | PERI_PPU_GR_ATT0_REGION_SIZE_Msk \
                                              ))
#define CY_PROT_PPU_GR_ATT1_MASK              ((uint32_t)~(PERI_PPU_GR_ATT1_UR_Msk \
                                                       | PERI_PPU_GR_ATT1_UX_Msk \
                                                       | PERI_PPU_GR_ATT1_PR_Msk \
                                                       | PERI_PPU_GR_ATT1_PX_Msk \
                                                       | PERI_PPU_GR_ATT1_PC_MASK_0_Msk \
                                                       | PERI_PPU_GR_ATT1_REGION_SIZE_Msk \
                                              ))
#define CY_PROT_PPU_SL_ATT0_MASK              ((uint32_t)~(PERI_GR_PPU_SL_ATT0_UX_Msk \
                                                       | PERI_GR_PPU_SL_ATT0_PX_Msk \
                                                       | PERI_GR_PPU_SL_ATT0_PC_MASK_0_Msk \
                                                       | PERI_GR_PPU_SL_ATT0_REGION_SIZE_Msk \
                                              ))
#define CY_PROT_PPU_SL_ATT1_MASK              ((uint32_t)~(PERI_GR_PPU_SL_ATT1_UR_Msk \
                                                       | PERI_GR_PPU_SL_ATT1_UX_Msk \
                                                       | PERI_GR_PPU_SL_ATT1_PR_Msk \
                                                       | PERI_GR_PPU_SL_ATT1_PX_Msk \
                                                       | PERI_GR_PPU_SL_ATT1_PC_MASK_0_Msk \
                                                       | PERI_GR_PPU_SL_ATT1_REGION_SIZE_Msk \
                                              ))
#define CY_PROT_PPU_RG_ATT0_MASK              ((uint32_t)~(PERI_GR_PPU_RG_ATT0_UX_Msk \
                                                       | PERI_GR_PPU_RG_ATT0_PX_Msk \
                                                       | PERI_GR_PPU_RG_ATT0_PC_MASK_0_Msk \
                                                       | PERI_GR_PPU_RG_ATT0_REGION_SIZE_Msk \
                                              ))
#define CY_PROT_PPU_RG_ATT1_MASK              ((uint32_t)~(PERI_GR_PPU_RG_ATT1_UR_Msk \
                                                       | PERI_GR_PPU_RG_ATT1_UX_Msk \
                                                       | PERI_GR_PPU_RG_ATT1_PR_Msk \
                                                       | PERI_GR_PPU_RG_ATT1_PX_Msk \
                                                       | PERI_GR_PPU_RG_ATT1_PC_MASK_0_Msk \
                                                       | PERI_GR_PPU_RG_ATT1_REGION_SIZE_Msk \
                                              ))

/** \endcond */


